app/views/posts/index.html.erb

          <% else %>
              <% post.recent_comments.each do |comment| %>
              <% poster = comment.author_id%>
              <% poster = User.find(poster) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3)  [["post_id", 39], ["post_id", 40], ["post_id", 41]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 8], ["LIMIT", 1]]