app/controllers/users_controller.rb

  def index
    @users = User.all.order('created_at DESC')
---
SELECT "users".* FROM "users" ORDER BY created_at DESC